-- © ᴄᴏᴘʏʀɪɢʜᴛ 2023, ᴘʀᴏxʏꜱᴄʀɪᴘᴛꜱ
-- ᴄᴏɴꜰɪɢ ꜱᴇᴛᴛɪɴɢꜱ
Config = {}

Config.washType = 'black_money' -- ​🇼​​🇭​​🇦​​🇹​ ​🇰​​🇮​​🇳​​🇩​ ​🇴​​🇫​ ​🇲​​🇴​​🇳​​🇪​​🇾​ ​🇼​​🇪​ ​🇸​​🇭​​🇴​​🇺​​🇱​​🇩​ ​🇷​​🇪​​🇲​​🇴​​🇻​​🇪​ ​🇮​​🇫​ ​🇼​​🇦​​🇸​​🇭​​🇪​​🇩​ (​🇪​.​🇬​ ❜​🇧​​🇦​​🇳​​🇰​❜, ❜​🇲​​🇴​​🇳​​🇪​​🇾​❜, ❜​🇩​​🇮​​🇷​​🇹​​🇾​_​🇲​​🇴​​🇳​​🇪​​🇾​❜)
Config.minWash = 1000 -- ​🇲​​🇮​​🇳​​🇮​​🇲​​🇺​​🇲​ ​🇲​​🇴​​🇳​​🇪​​🇾​ ​🇳​​🇪​​🇪​​🇩​​🇪​​🇩​ ​🇹​​🇴​ ​🇼​​🇦​​🇸​​🇭​ (​🇺​​🇳​​🇩​​🇪​​🇷​ ​🇹​​🇭​​🇦​​🇹​ ​🇦​​🇲​​🇴​​🇺​​🇳​​🇹​ ​🇹​​🇭​​🇪​ ​🇼​​🇦​​🇸​​🇭​ ​🇼​​🇴​​🇳​​🇹​ ​🇼​​🇴​​🇷​​🇰​)
Config.maxWash = 50000 -- ​🇲​​🇦​​🇽​​🇮​​🇲​​🇺​​🇲​ ​🇦​​🇲​​🇴​​🇺​​🇳​​🇹​ ​🇴​​🇫​ ​🇲​​🇴​​🇳​​🇪​​🇾​ (​🇦​​🇧​​🇴​​🇻​​🇪​ ​🇹​​🇭​​🇦​​🇹​ ​🇦​​🇲​​🇴​​🇺​​🇳​​🇹​ ​🇹​​🇭​​🇪​ ​🇼​​🇦​​🇸​​🇭​ ​🇼​​🇴​​🇳​​🇹​ ​🇼​​🇴​​🇷​​🇰​)
Config.vatWash = 15 -- ᴛʜᴇ ᴠᴀᴛ % ᴛʜᴀᴛ ɢᴇᴛꜱ ᴅᴇᴅᴜᴄᴛᴇᴅ ꜰʀᴏᴍ ᴛʜᴇ ᴏʀɪɢɪɴᴀʟ ᴍᴏɴᴇʏ (ᴇ.ɢ 5000$ - 15% = 4250$)
Config.washTime = 5000 -- ᴛʜᴇ ᴛɪᴍᴇ ᴜɴᴛɪʟ ᴛʜᴇ ᴡᴀꜱʜɪɴɢ ɪꜱ ᴄᴏᴍᴘʟᴇᴛᴇᴅ (ᴛʜɪꜱ ɪꜱ ɪɴ ᴍɪʟʟɪ ꜱᴇᴄᴏɴᴅꜱ ᴇ.ɢ 5000ᴍꜱ = 5ꜱ)

Config.Webhook = true -- ​🇭​​🇪​​🇷​​🇪​ ​🇾​​🇴​​🇺​ ​🇨​​🇦​​🇳​ ​🇪​​🇳​​🇦​​🇧​​🇱​​🇪​ ​🇮​​🇫​ ​🇾​​🇴​​🇺​ ​🇼​​🇦​​🇳​​🇹​ ​🇹​​🇴​ ​🇱​​🇴​​🇬​ ​🇹​​🇭​​🇪​ ​🇲​​🇴​​🇳​​🇪​​🇾​ ​🇼​​🇦​​🇸​​🇭​
Config.WebhookLink = 'https://discord.com/api/webhooks/1177963205222477875/vWXA2yCfPXYXML55CrSjmUNLZsNbiE3b9N3BO9RLZFaNa9Mbk7l--UC7i1rjK_Pdz1wL' -- ​🇭​​🇪​​🇷​​🇪​ ​🇾​​🇴​​🇺​ ​🇨​​🇦​​🇳​ ​🇵​​🇺​​🇹​ ​🇹​​🇭​​🇪​ ​🇼​​🇪​​🇧​​🇭​​🇴​​🇴​​🇰​ ​🇱​​🇮​​🇳​​🇰​ ​🇴​​🇫​ ​🇾​​🇴​​🇺​​🇷​ ​🇩​​🇮​​🇸​​🇨​​🇴​​🇷​​🇩​

Config.washingMarkerColors = {r = 255, g = 127, b = 0, a = 0.5}
Config.washingLocation = {
    [1] = {name = "San Andreas Money Wash", location = vec3(221.5408, -854.3217, 30.0709)},
    [2] = {name = "Los Angeles Money Wash", location = vec3(224.1880, -842.7039, 30.3006)}
}

Config.useCustomNotify = true -- ​🇮​​🇫​ ​🇾​​🇴​​🇺​ ​🇼​​🇦​​🇳​​🇹​ ​🇹​​🇴​ ​🇺​​🇸​​🇪​ ​🇦​ ​🇨​​🇺​​🇸​​🇹​​🇴​​🇲​ ​🇳​​🇴​​🇹​​🇮​​🇫​​🇮​​🇨​​🇦​​🇹​​🇮​​🇴​​🇳​ ​🇸​​🇾​​🇸​​🇹​​🇪​​🇲​
Config.NotifySystem = {
    notifyTrigger = 'okokNotify:Alert', -- ʏᴏᴜʀ ɴᴏᴛɪꜰɪᴄᴀᴛɪᴏɴ ꜱʏꜱᴛᴇᴍ (ᴇ.ɢ ᴏᴋᴏᴋɴᴏᴛɪꜰʏ, ʙ-ɴᴏᴛɪꜰʏ, ᴄᴏᴅᴇᴍ-ɴᴏᴛɪꜰʏ)
    notifyTitle = 'Notification', -- ​🇹​​🇭​​🇪​ ​🇹​​🇮​​🇹​​🇱​​🇪​ ​🇴​​🇫​ ​🇹​​🇭​​🇪​ ​🇳​​🇴​​🇹​​🇮​​🇫​​🇮​​🇨​​🇦​​🇹​​🇮​​🇴​​🇳​
    notifyTime = 5000, -- ​🇹​​🇭​​🇪​ ​🇹​​🇮​​🇲​​🇪​ ​🇹​​🇭​​🇪​ ​🇳​​🇴​​🇹​​🇮​​🇫​​🇮​​🇨​​🇦​​🇹​​🇮​​🇴​​🇳​ ​🇸​​🇭​​🇴​​🇺​​🇱​​🇩​ ​🇱​​🇦​​🇸​​🇹​
}

Config.Messages = {
    ['showPopUp'] = 'Press ~INPUT_PICKUP~ to open the Money Wash',
    ['nothingtoWash'] = 'There is nothing to wash.',
    ['ifisNull'] = 'Please use a valid number!',
}